Рассмотрим три числа
𝑎
a,
𝑏
b и
𝑐
c. Упорядочим их по возрастанию.

Какое число будет стоять между двумя другими?

Решение этой задачи на С++ могло бы выглядеть так:

#include <iostream>
#include <algorithm>

using namespace std;

int main()
{
int a[3];
for (int i = 0; i < 3; ++i) cin >> a[i];
sort(a, a + 3);
cout << a[1] << endl;
return 0;
}
Формат ввода
В единственной строке записаны три целых числа
𝑎
a,
𝑏
b,
𝑐
c (
−
1000
≤
𝑎
,
𝑏
,
𝑐
≤
1000
−1000≤a,b,c≤1000), числа разделены одиночными пробелами.

Формат вывода
Выведите число, которое будет стоять между двумя другими после упорядочивания.